
#Область ПрограммныйИнтерфейс

// Функция - Подтверждает, что обработка является обработкой обслуживания
// 
// Возвращаемое значение:
//  Булево - Истина
//
Функция ЭтоОбработкаЛогирования() Экспорт
	
	Возврат Истина;
	
КонецФункции //ЭтоОбработкаЛогирования()

// Функция - определяет, что способ логирования позволяет вывод лога на клиенте
// 
// Возвращаемое значение:
//  Булево - Истина
//
Функция ВыводитьНаКлиенте() Экспорт
	
	Возврат Истина;
	
КонецФункции //ВыводитьНаКлиенте()

// Функция - определяет, что способ логирования позволяет вывод лога на сервере
// 
// Возвращаемое значение:
//  Булево - Истина
//
Функция ВыводитьНаСервере() Экспорт
	
	Возврат Ложь;
	
КонецФункции //ВыводитьНаСервере()

// Функция - Получает форму обработчиков команд, где расположены процедуры-обработчики команд
// 			 из списка действий кнопки открытия поля выбора обработки обслуживания
// 
// Возвращаемое значение:
//  Строка - Имя формы обработчиков комманд
//
Функция ПолучитьФормуОбработчиковКоманд() Экспорт
	
	Возврат "Форма";
	
КонецФункции //ПолучитьФормуОбработчиковКоманд()

// Функция - Получает список действий кнопки открытия поля выбора обработки обслуживания
// 
// Возвращаемое значение:
//  СписокЗначений - Список действий
//
Функция ПолучитьСписокДействийКнопкиОткрытия() Экспорт
	
	СписокДействий = Новый СписокЗначений();
	
	Возврат СписокДействий;
	
КонецФункции //ПолучитьСписокДействийКнопкиОткрытия()

// Процедура выполняет запись в журнал регистрации 1С
//
// Параметры:
//	Текст					- Строка					- текст выводимого сообщения
//	СпособЛогирования		- СправочникСсылка.			- ссылка на способ логирования
//							  ктв_СпособыЛогирования
//	ПараметрыЗаписи			- Структура					- параметры записи информации в журнал регистрации
//
Процедура ЗаписатьВЛог(Текст, СпособЛогирования, ПараметрыЗаписи) Экспорт
	
КонецПроцедуры //ЗаписатьВЛог()

#КонецОбласти

#Область СлужебныеПроцедуры

#КонецОбласти
