
// Процедура выполняет запись в лог на сервере
//
// Параметры:
//	Текст					- Строка					- текст выводимого сообщения
//	ПеремПараметрыЗаписи	- Структура					- дополнительные параметры записи информации в лог
//
Процедура ЗаписатьВЛог(Текст, ПараметрыЗаписи = Неопределено) Экспорт
	
	УровниЛога = ктв_Логирование.УровниЛога();
	
	ВремУровень = "ИНФОРМАЦИЯ";
	
	Если ПараметрыЗаписи.Свойство("УровеньЛога") Тогда
		
		Если ПараметрыЗаписи.УровеньЛога = УровниЛога.Отладка Тогда
			ВремУровень = "ОТЛАДКА";
		ИначеЕсли ПараметрыЗаписи.УровеньЛога = УровниЛога.Информация Тогда
			ВремУровень = "ИНФОРМАЦИЯ";
		ИначеЕсли ПараметрыЗаписи.УровеньЛога = УровниЛога.Предупреждение Тогда
			ВремУровень = "ПРЕДУПРЕЖДЕНИЕ";
		ИначеЕсли ПараметрыЗаписи.УровеньЛога = УровниЛога.Ошибка Тогда
			ВремУровень = "ОШИБКА";
		ИначеЕсли ПараметрыЗаписи.УровеньЛога = УровниЛога.КритичнаяОшибка Тогда
			ВремУровень = "КРИТИЧНАЯ ОШИБКА";
		КонецЕсли;
	КонецЕсли;
	
	Если ПараметрыЗаписи.Свойство("Метаданные") Тогда
		ВремМетаданные = ПараметрыЗаписи.Метаданные;
	КонецЕсли;
	
	СообщениеПользователю = Новый СообщениеПользователю();
	СообщениеПользователю.Текст = СокрЛП(ТекущаяДата()) + ": " + ВремУровень + " - " + Текст;
	
	Если ПараметрыЗаписи.Свойство("ИдентификаторНазначения") Тогда
		СообщениеПользователю.ИдентификаторНазначения = ПараметрыЗаписи.ИдентификаторНазначения;
	КонецЕсли;
	
	Если ПараметрыЗаписи.Свойство("КлючДанных") Тогда
		СообщениеПользователю.КлючДанных = ПараметрыЗаписи.КлючДанных;
	КонецЕсли;
	
	Если ПараметрыЗаписи.Свойство("Поле") Тогда
		СообщениеПользователю.Поле = ПараметрыЗаписи.Поле;
	КонецЕсли;
	
	Если ПараметрыЗаписи.Свойство("ПутьКДанным") Тогда
		СообщениеПользователю.ПутьКДанным = ПараметрыЗаписи.ПутьКДанным;
	КонецЕсли;
	
	Если ПараметрыЗаписи.Свойство("Данные") Тогда
		СообщениеПользователю.УстановитьДанные(ПараметрыЗаписи.Данные);
	КонецЕсли;
	
	СообщениеПользователю.Сообщить();
	
КонецПроцедуры //ЗаписатьВЛог()
