////////////////////////////////////////////////////////////////////////////////
// Подсистема "Логирование". (Основной модуль)
//
////////////////////////////////////////////////////////////////////////////////


#Область СлужебныеПроцедуры


#КонецОбласти 

#Область ОбработкаЛогирования

// Процедура выполняет запись в лог
//
Функция ПолучитьСпособыЛогирования(ИмяЛога) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	                      |	ИспользованиеИменЛогов.СпособЛогирования КАК СпособЛогирования
	                      |ИЗ
	                      |	РегистрСведений.ктв_ИспользованиеИменЛогов КАК ИспользованиеИменЛогов
	                      |ГДЕ
	                      |	ИспользованиеИменЛогов.ИмяЛога = &ИмяЛога
	                      |	ИЛИ ИспользованиеИменЛогов.СпособЛогирования.ИспользоватьДляВсех");
	
	Запрос.УстановитьПараметр("ИмяЛога", ИмяЛога);
	
	Результат = Запрос.Выполнить();
	
	Возврат Результат.Выгрузить().ВыгрузитьКолонку("СпособЛогирования");
	
КонецФункции //ПолучитьСпособыЛогирования()

// Процедура выполняет запись в лог
//
Процедура ЗаписатьВЛог(ИмяЛога, УровеньЛога, Текст, ПараметрыЗаписи) Экспорт
	
	СпособыЛогирования = ПолучитьСпособыЛогирования(ИмяЛога);
	
	Для Каждого ТекСпособ Из СпособыЛогирования Цикл
		ЗаписатьВЛогПоСпособуЛогирования(ТекСпособ, ИмяЛога, УровеньЛога, Текст, ПараметрыЗаписи);
	КонецЦикла;
	
КонецПроцедуры //ЗаписатьВЛог()

// Процедура выполняет запись в лог
//
Процедура ЗаписатьВЛогПоСпособуЛогирования(СпособЛогирования, ИмяЛога, УровеньЛога, Текст, ПараметрыЗаписи) Экспорт
	
	ВремОбработка = СпособЛогирования.Обработка.Получить();
	ВремОбработка = ?(ТипЗнч(ВремОбработка) = Тип("Строка"), ВремОбработка, ПолучитьНавигационнуюСсылку(СпособЛогирования, "Обработка"));
	
	ОбработкаОбъект = ктв_ОбработкиОбслуживания.ПолучитьОбработкуОбъект(ВремОбработка);
	
	ТекстОшибки = "";
	
	Попытка
		
		Результат = Неопределено;
		
		Результат = ОбработкаОбъект.ЗаписатьВЛог(ИмяЛога, УровеньЛога, Текст, ПараметрыЗаписи);
		
		Если ПараметрыЗаписи.Свойство("ТекстОшибки") Тогда
			ТекстОшибки = ПараметрыЗаписи.ТекстОшибки;
		КонецЕсли;
		
	Исключение
		ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		Если ПараметрыЗаписи.Свойство("ТекстОшибки") Тогда
			ПараметрыЗаписи.ТекстОшибки = ПараметрыЗаписи.ТекстОшибки + Символы.ПС + ТекстОшибки;
		Иначе
			ПараметрыЗаписи.Вставить("ТекстОшибки", ТекстОшибки);
		КонецЕсли;
	КонецПопытки;
	
КонецПроцедуры //ЗаписатьВЛогПоСпособуЛогирования()

#КонецОбласти

