
#Область ПрограммныйИнтерфейс

// Функция - Подтверждает, что обработка является обработкой обслуживания
// 
// Возвращаемое значение:
//  Булево - Истина
//
Функция ЭтоОбработкаЛогирования() Экспорт
	
	Возврат Истина;
	
КонецФункции //ЭтоОбработкаЛогирования()

// Функция - определяет, что способ логирования позволяет вывод лога на клиенте
// 
// Возвращаемое значение:
//  Булево - Истина
//
Функция ВыводитьНаКлиенте() Экспорт
	
	Возврат Ложь;
	
КонецФункции //ВыводитьНаКлиенте()

// Функция - определяет, что способ логирования позволяет вывод лога на сервере
// 
// Возвращаемое значение:
//  Булево - Истина
//
Функция ВыводитьНаСервере() Экспорт
	
	Возврат Истина;
	
КонецФункции //ВыводитьНаСервере()

// Функция - Получает форму обработчиков команд, где расположены процедуры-обработчики команд
// 			 из списка действий кнопки открытия поля выбора обработки обслуживания
// 
// Возвращаемое значение:
//  Строка - Имя формы обработчиков комманд
//
Функция ПолучитьФормуОбработчиковКоманд() Экспорт
	
	Возврат "Форма";
	
КонецФункции //ПолучитьФормуОбработчиковКоманд()

// Функция - Получает список действий кнопки открытия поля выбора обработки обслуживания
// 
// Возвращаемое значение:
//  СписокЗначений - Список действий
//
Функция ПолучитьСписокДействийКнопкиОткрытия() Экспорт
	
	СписокДействий = Новый СписокЗначений();
	
	Возврат СписокДействий;
	
КонецФункции //ПолучитьСписокДействийКнопкиОткрытия()

// Процедура выполняет запись в журнал регистрации 1С
//
// Параметры:
//	Текст					- Строка					- текст выводимого сообщения
//	СпособЛогирования		- СправочникСсылка.			- ссылка на способ логирования
//							  ктв_СпособыЛогирования
//	ПараметрыЗаписи			- Структура					- параметры записи информации в журнал регистрации
//
Процедура ЗаписатьВЛог(Текст, СпособЛогирования, ПараметрыЗаписи) Экспорт
	
	УровниЛога = ктв_Логирование.УровниЛога();
	
	ВремУровень = УровеньЖурналаРегистрации.Информация;
	
	Если ПараметрыЗаписи.Свойство("УровеньЛога") Тогда
		
		Если ПараметрыЗаписи.УровеньЛога = УровниЛога.Отладка Тогда
			ВремУровень = УровеньЖурналаРегистрации.Примечание;
		ИначеЕсли ПараметрыЗаписи.УровеньЛога = УровниЛога.Информация Тогда
			ВремУровень = УровеньЖурналаРегистрации.Примечание;
		ИначеЕсли ПараметрыЗаписи.УровеньЛога = УровниЛога.Предупреждение Тогда
			ВремУровень = УровеньЖурналаРегистрации.Примечание;
		ИначеЕсли ПараметрыЗаписи.УровеньЛога = УровниЛога.Ошибка Тогда
			ВремУровень = УровеньЖурналаРегистрации.Ошибка;
		ИначеЕсли ПараметрыЗаписи.УровеньЛога = УровниЛога.КритичнаяОшибка Тогда
			ВремУровень = УровеньЖурналаРегистрации.Ошибка;
		КонецЕсли;
	КонецЕсли;
	
	Если ПараметрыЗаписи.Свойство("ИмяЛога") Тогда
		ИмяСобытия = ПараметрыЗаписи.ИмяЛога;
	Иначе
		ИмяСобытия = "Прочее";
	КонецЕсли;
	
	ВремМетаданные = Неопределено;
	Если ПараметрыЗаписи.Свойство("Метаданные") Тогда
		ВремМетаданные = ПараметрыЗаписи.Метаданные;
	КонецЕсли;
	
	ВремДанные = Неопределено;
	Если ПараметрыЗаписи.Свойство("Данные") Тогда
		ВремДанные = ПараметрыЗаписи.Данные;
	КонецЕсли;
	
	ЗаписьЖурналаРегистрации(ИмяСобытия, ВремУровень, ВремМетаданные, ВремДанные, Текст);
	
КонецПроцедуры //ЗаписатьВЛог()

#КонецОбласти

#Область СлужебныеПроцедуры

#КонецОбласти
