////////////////////////////////////////////////////////////////////////////////
// Библиотека подключаемых обработок обслуживания. (Передача обработки на сервер)
//
////////////////////////////////////////////////////////////////////////////////


// Функция - Получает список обработок обслуживания в конфигурации
//
// Параметры:
//  ПрефиксОбработки				 - Строка				 - Начало имени обработки для отбора обработок конфигурации
//  ИмяКонтрольнойПроцедуры			 - Строка				 - Имя функции модуля объекта обработки, вызываемой для проверки, что обработка является обработкой обслуживания
//  ПараметрыКонтрольнойПроцедуры	 - Массив				 - Парметры функции, вызываемой для проверки
// 
// Возвращаемое значение:
//  СписокЗначений					 - Список обработок обслуживания
//
Функция ПолучитьСписокОбработокОбслуживания(ПрефиксОбработки = Неопределено
										  , ИмяКонтрольнойПроцедуры = Неопределено
										  , ПараметрыКонтрольнойПроцедуры = Неопределено) Экспорт
	
	Возврат	ктв_ОбработкиОбслуживания.ПолучитьСписокОбработокОбслуживания(ПрефиксОбработки
																		, ИмяКонтрольнойПроцедуры
																		, ПараметрыКонтрольнойПроцедуры);
	
КонецФункции //ПолучитьСписокОбработокОбслуживания()

// Функция - Проверяет, что обработка является обработкой обслуживания
//
// Параметры:
//  АдресОбработки					 - Строка, ОбработкаОбъект	 - Имя встроенной обработки, или адрес внешней обработки во временном хранилище, или ранее созданная обработка 
//  ИмяКонтрольнойПроцедуры			 - Строка					 - Имя функции модуля объекта обработки, вызываемой для проверки, что обработка является обработкой обслуживания
//  ПараметрыКонтрольнойПроцедуры	 - Массив					 - Парметры функции, вызываемой для проверки
// 
// Возвращаемое значение:
//   Булево							 - Истина - обработка является обработкой обслуживания, Ложь - в противном случае
//
Функция ЭтоОбработкаОбслуживания(АдресОбработки, ИмяКонтрольнойПроцедуры = Неопределено, ПараметрыКонтрольнойПроцедуры = Неопределено) Экспорт
	
	Возврат ктв_ОбработкиОбслуживания.ЭтоОбработкаОбслуживания(АдресОбработки, ИмяКонтрольнойПроцедуры, ПараметрыКонтрольнойПроцедуры);
	
КонецФункции //ЭтоОбработкаОбслуживания()

// Функция - Получает описание обработки обслуживания
//
// Параметры:
//  АдресОбработки	 - Строка				 - Имя встроенной обработки или адрес обработки во временном хранилище
//  ИмяОбработки	 - Строка				 - Имя по которым будет подключена внешняя обработка
// 
// Возвращаемое значение:
//  Структура								 - Описание обработки обслуживания
//
Функция ПолучитьОписаниеОбработкиОбслуживания(АдресОбработки, ИмяОбработки = "") Экспорт
	
	Возврат ктв_ОбработкиОбслуживания.ПолучитьОписаниеОбработкиОбслуживания(АдресОбработки, ИмяОбработки, Ложь);
	
КонецФункции //ПолучитьОписаниеОбработкиОбслуживания()

// Функция - получает адрес обработки обслуживания
//
// Параметры:
//  Элемент							 - ЛюбаяСсылка		 - ссылка на объект-контейнер обработки обслуживания
//  ПутьКДаннымОбработки			 - Строка			 - имя реквизита объекта-контейнера, хранящего обработку обслуживания
// 
// Возвращаемое значение:
//   Строка							 - имя встроенной обработки или навигационная ссылка на сохраненную внешнюю обработку
//
Функция ПолучитьАдресОбработкиОбслуживанияЭлемента(Элемент, ПутьКДаннымОбработки) Экспорт
	
	Возврат ктв_ОбработкиОбслуживания.ПолучитьАдресОбработкиОбслуживанияЭлемента(Элемент, ПутьКДаннымОбработки);
	
КонецФункции //ПолучитьАдресОбработкиОбслуживанияЭлемента()
