
&НаСервереБезКонтекста
Процедура ЗаписатьВЛогНаСервереСервер(ИмяЛога, Сообщение, УровеньЛога)
	
	Лог = ктв_Логирование.ПолучитьЛог(ИмяЛога);
	
	Лог.ЗаписатьВЛог(Сообщение, УровеньЛога);

КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьВЛогНаКлиенте(Команда)
	
	Лог = ктв_Логирование.ПолучитьЛог(ИмяЛога, Новый Структура("ИдентификаторНазначения", ЭтаФорма.УникальныйИдентификатор));
	
	Лог.ЗаписатьВЛог(Сообщение, УровеньЛога);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьВЛогНаСервере(Команда)
	ЗаписатьВЛогНаСервереСервер(ИмяЛога, Сообщение, УровеньЛога);
КонецПроцедуры
