
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если НЕ Параметры.Отбор.Свойство("СпособЛогирования") Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Параметры.Отбор.СпособЛогирования) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры //ПриСозданииНаСервере()

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Для Каждого ТекЗапись Из ТекущийОбъект Цикл
		ТекЗапись.СпособЛогирования = ТекущийОбъект.Отбор.СпособЛогирования.Значение;
	КонецЦикла;
	
КонецПроцедуры //ПередЗаписьюНаСервере()

&НаКлиенте
Процедура НаборЗаписейПриИзменении(Элемент)

	МожноЗаписывать = Истина;
	
	Для Каждого ТекЗапись Из НаборЗаписей Цикл
		Если ПустаяСтрока(ТекЗапись.ИмяЛога) Тогда
			МожноЗаписывать = Ложь;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если МожноЗаписывать Тогда
		Записать();
	КонецЕсли;
	
КонецПроцедуры //НаборЗаписейПриИзменении()

&НаСервереБезКонтекста
Функция ПолучитьИменаЛогов(Знач Исключения)
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	ИспользованиеИменЛогов.ИмяЛога КАК ИмяЛога
	                      |ИЗ
	                      |	РегистрСведений.ктв_ИспользованиеИменЛогов КАК ИспользованиеИменЛогов
	                      |ГДЕ
	                      |	НЕ ИспользованиеИменЛогов.ИмяЛога В (&Исключения)
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ИмяЛога");
	
	Если НЕ ТипЗнч(Исключения) = Тип("Массив") Тогда
		Исключения = Новый Массив();
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Исключения", Исключения);
	
	Результат = Запрос.Выполнить();
	
	Возврат Результат.Выгрузить().ВыгрузитьКолонку("ИмяЛога");
	
КонецФункции //ПолучитьИменаЛогов()

&НаКлиенте
Процедура ИмяЛогаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)

	ТекущиеДанные = Элементы.НаборЗаписей.ТекущиеДанные;
	
	Исключения = Новый Массив();
	
	Для Каждого ТекЗапись Из НаборЗаписей Цикл
		Если ПустаяСтрока(ТекЗапись.ИмяЛога) Тогда
			Продолжить;
		КонецЕсли;
		Если НЕ ТекущиеДанные = Неопределено Тогда
			Если ТекущиеДанные.ИмяЛога = ТекЗапись.ИмяЛога Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		Исключения.Добавить(ТекЗапись.ИмяЛога);
	КонецЦикла;
	
	Элементы.ИмяЛога.СписокВыбора.ЗагрузитьЗначения(ПолучитьИменаЛогов(Исключения));
	
КонецПроцедуры //ИмяЛогаНачалоВыбора()

